ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/RTI_RTI_52180000h.xml
		<bitfield id="TBHCOMP" width="32" begin="31" end="0" resetval="0x0" description="TBHCOMP: Timebase High Compare Value.This value determines when the edge detection circuit will stop monitoring the NTUx signal. It will be compared with Up Counter 0.RTITBHCOMP has to be less than RTICPUC0, since RTIUC0 will be reset when RTICPUC0 is reached.Example:The NTUx edge detection circuit should be active +/- 10 RTICLK cycles around RTICPUC0.RTICPUC0 = 0x00000050RTITBLCOMP = 0x000046RTITBHCOMP = 0x00000009User and privilege mode [read]:current compare valuePrivilege mode [write when TBEXT = 0]:the compare value is updatedPrivilege mode [write when TBEXT = 1]:the compare value is not changedNote: Reset behaviorA reset does not generate a compare match." range="31:0" rwaccess="R/W"/>
	</register><register id="RTI_RTISETINT" acronym="RTI_RTISETINT" offset="128" width="32" description="Set Interrupt Enable sets interrupt enable bits int RTIINTCTRL without having to do a read-modify-write operation.">
		<bitfield id="RESERVED11" width="13" begin="31" end="19" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:19" rwaccess="R/W"/>
	<bitfield id="SETOVL1INT" width="1" begin="18" end="18" resetval="0x0" description="SETOVL1INT: Set Free Running Counter 1 Overflow Interrupt.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable interrupt" range="18" rwaccess="R/W"/>
	<bitfield id="SETOVL0INT" width="1" begin="17" end="17" resetval="0x0" description="SETOVL0INT: Set Free Running Counter 0 Overflow Interrupt.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable interrupt" range="17" rwaccess="R/W"/>
	<bitfield id="SETTBINT" width="1" begin="16" end="16" resetval="0x0" description="SETTBINT: Set Timebase Interrupt.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable interrupt" range="16" rwaccess="R/W"/>
	<bitfield id="RESERVED10" width="4" begin="15" end="12" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="15:12" rwaccess="R/W"/>
	<bitfield id="SETDMA3" width="1" begin="11" end="11" resetval="0x0" description="SETDMA3: Set Compare DMA Request 3.User and privilege mode [read]:0 = DMA request is disabled1 = DMA request is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable DMA request" range="11" rwaccess="R/W"/>
	<bitfield id="SETDMA2" width="1" begin="10" end="10" resetval="0x0" description="SETDMA2: Set Compare DMA Request 2.User and privilege mode [read]:0 = DMA request is disabled1 = DMA request is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable DMA request" range="10" rwaccess="R/W"/>
	<bitfield id="SETDMA1" width="1" begin="9" end="9" resetval="0x0" description="SETDMA1: Set Compare DMA Request 1.User and privilege mode [read]:0 = DMA request is disabled1 = DMA request is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable DMA request" range="9" rwaccess="R/W"/>
	<bitfield id="SETDMA0" width="1" begin="8" end="8" resetval="0x0" description="SETDMA0: Set Compare DMA Request 0.User and privilege mode [read]:0 = DMA request is disabled1 = DMA request is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable DMA request" range="8" rwaccess="R/W"/>
	<bitfield id="RESERVED9" width="4" begin="7" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="7:4" rwaccess="R/W"/>
	<bitfield id="SETINT3" width="1" begin="3" end="3" resetval="0x0" description="SETINT3: Set Compare Interrupt 3.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged" range="3" rwaccess="R/W"/>
	<bitfield id="SETINT2" width="1" begin="2" end="2" resetval="0x0" description="SETINT2: Set Compare Interrupt 2.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable interrupt" range="2" rwaccess="R/W"/>
	<bitfield id="SETINT1" width="1" begin="1" end="1" resetval="0x0" description="SETINT1: Set Compare Interrupt 1.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable interrupt" range="1" rwaccess="R/W"/>
	<bitfield id="SETINT0" width="1" begin="0" end="0" resetval="0x0" description="SETINT0: Set Compare Interrupt 0.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = enable interrupt" range="0" rwaccess="R/W"/>
	</register><register id="RTI_RTICLEARINT" acronym="RTI_RTICLEARINT" offset="132" width="32" description="Clear Interrupt Enable clears interrupt enable bits int RTIINTCTRL without having to do a read-modify-write operation.">
		<bitfield id="RESERVED14" width="13" begin="31" end="19" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:19" rwaccess="R/W"/>
	<bitfield id="CLEAROVL1INT" width="1" begin="18" end="18" resetval="0x0" description="CLEAROVL1INT: CLEAR Free Running Counter 1 Overflow Interrupt.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable interrupt" range="18" rwaccess="R/W"/>
	<bitfield id="CLEAROVL0INT" width="1" begin="17" end="17" resetval="0x0" description="CLEAROVL0INT: CLEAR Free Running Counter 0 Overflow Interrupt.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable interrupt" range="17" rwaccess="R/W"/>
	<bitfield id="CLEARTBINT" width="1" begin="16" end="16" resetval="0x0" description="CLEARTBINT: CLEAR Timebase Interrupt.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable interrupt" range="16" rwaccess="R/W"/>
	<bitfield id="RESERVED13" width="4" begin="15" end="12" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="15:12" rwaccess="R/W"/>
	<bitfield id="CLEARDMA3" width="1" begin="11" end="11" resetval="0x0" description="CLEARDMA3: CLEAR Compare DMA Request 3.User and privilege mode [read]:0 = DMA request is disabled1 = DMA request is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable DMA request" range="11" rwaccess="R/W"/>
	<bitfield id="CLEARDMA2" width="1" begin="10" end="10" resetval="0x0" description="CLEARDMA2: CLEAR Compare DMA Request 2.User and privilege mode [read]:0 = DMA request is disabled1 = DMA request is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable DMA request" range="10" rwaccess="R/W"/>
	<bitfield id="CLEARDMA1" width="1" begin="9" end="9" resetval="0x0" description="CLEARDMA1: CLEAR Compare DMA Request 1.User and privilege mode [read]:0 = DMA request is disabled1 = DMA request is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable DMA request" range="9" rwaccess="R/W"/>
	<bitfield id="CLEARDMA0" width="1" begin="8" end="8" resetval="0x0" description="CLEARDMA0: CLEAR Compare DMA Request 0.User and privilege mode [read]:0 = DMA request is disabled1 = DMA request is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable DMA request" range="8" rwaccess="R/W"/>
	<bitfield id="RESERVED12" width="4" begin="7" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="7:4" rwaccess="R/W"/>
	<bitfield id="CLEARINT3" width="1" begin="3" end="3" resetval="0x0" description="CLEARINT3: CLEAR Compare Interrupt 3.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable interrupt" range="3" rwaccess="R/W"/>
	<bitfield id="CLEARINT2" width="1" begin="2" end="2" resetval="0x0" description="CLEARINT2: CLEAR Compare Interrupt 2.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable interrupt" range="2" rwaccess="R/W"/>
	<bitfield id="CLEARINT1" width="1" begin="1" end="1" resetval="0x0" description="CLEARINT1: CLEAR Compare Interrupt 1.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable interrupt" range="1" rwaccess="R/W"/>
	<bitfield id="CLEARINT0" width="1" begin="0" end="0" resetval="0x0" description="CLEARINT0: CLEAR Compare Interrupt 0.User and privilege mode [read]:0 = interrupt is disabled1 = interrupt is enabledPrivilege mode [write]:0 = leaves the corresponding bit unchanged1 = disable interrupt" range="0" rwaccess="R/W"/>
	</register><register id="RTI_RTIINTFLAG" acronym="RTI_RTIINTFLAG" offset="136" width="32" description="Interrupt Flags interrupt pending bits.">
		<bitfield id="RESERVED16" width="13" begin="31" end="19" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:19" rwaccess="R/W"/>
	<bitfield id="OVL1INT" width="1" begin="18" end="18" resetval="0x0" description="OVL1INT: Free Running Counter 1 Overflow Interrupt Flag.User and privilege mode [read]:determines if an interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode [write]:0 = leaves the bit unchanged1 = set the bit to 0" range="18" rwaccess="R/W"/>
	<bitfield id="OVL0INT" width="1" begin="17" end="17" resetval="0x0" description="OVL0INT: Free Running Counter 0 Overflow Interrupt Flag.User and privilege mode [read]:determines if an interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode [write]:0 = leaves the bit unchanged1 = set the bit to 0" range="17" rwaccess="R/W"/>
	<bitfield id="TBINT" width="1" begin="16" end="16" resetval="0x0" description="User and privilege mode [read]:this flag is set when the TBEXT bit is cleared by detection of a missing external clockedge. It will not be set by clearing TBEXT by software.determines if an interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode [write]:0 = leaves the bit unchanged1 = set the bit to 0" range="16" rwaccess="R/W"/>
	<bitfield id="RESERVED15" width="12" begin="15" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="15:4" rwaccess="R/W"/>
	<bitfield id="INT3" width="1" begin="3" end="3" resetval="0x0" description="INT3: Interrupt Flag 3.User and privilege mode [read]:determines if a interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode [write]:0 = leaves the bit unchanged1 = set the bit to 0" range="3" rwaccess="R/W"/>
	<bitfield id="INT2" width="1" begin="2" end="2" resetval="0x0" description="INT2: Interrupt Flag 2.User and privilege mode [read]:determines if a interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode [write]:0 = leaves the bit unchanged1 = set the bit to 0" range="2" rwaccess="R/W"/>
	<bitfield id="INT1" width="1" begin="1" end="1" resetval="0x0" description="INT1: Interrupt Flag 1.User and privilege mode [read]:determines if a interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode [write]:0 = leaves the bit unchanged1 = set the bit to 0" range="1" rwaccess="R/W"/>
	<bitfield id="INT0" width="1" begin="0" end="0" resetval="0x0" description="INT0: Interrupt Flag 0.User and privilege mode [read]:determines if a interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode [write]:0 = leaves the bit unchanged1 = set the bit to 0" range="0" rwaccess="R/W"/>
	</register><register id="RTI_RTIDWDCTRL" acronym="RTI_RTIDWDCTRL" offset="144" width="32" description="Digital Watchdog Control Enables the Digital Watchdog.">
		<bitfield id="DWDCTRL" width="32" begin="31" end="0" resetval="0x0" description="DWDCTRL: Digital Watchdog Control.User and priviledge mode [read]:0x5312ACED = DWD counter is disabled. This is the default value.0xA98559DA = DWD counter is enabledAny other value = DWD counter state is unchanged [enabled or disabled]Priviledge mode [write]:0xA98559DA = DWD counter is enabledAny other value = State of DWD counter is unchanged [stays enabled or disabled]Note: One-Write Functionality of DWDCTRL RegisterThe RTIDWDCTRL register implements a one-write functionality, such that the application cannot write to this registermore than once. Writing the default value will not enable the watchdog as described above. Writing the enable value will start the watchdog counters. A write to RTIDWDCTRL will only be enabled after a system reset again." range="31:0" rwaccess="R/W"/>
	</register><register id="RTI_RTIDWDPRLD" acronym="RTI_RTIDWDPRLD" offset="148" width="32" description="Digital Watchdog Preload sets the experation time of the Digital Watchdog.">
		<bitfield id="RESERVED17" width="20" begin="31" end="12" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:12" rwaccess="R/W"/>
	<bitfield id="DWDPRLD" width="12" begin="11" end="0" resetval="0x0" description="DWDPRLD: Digital Watchdog Preload Value.User and priviledge mode [read]:A read from this register in any CPU mode returns the current preload value.Priviledge mode [write]:The DWD preload register can be configured only when the DWD is disabled.Therefore, the application can only configure the DWD preload register before it enables the DWD down counter.The expiration time of the DWD Down Counter can be determined with following equation:texp = [RTIDWDPRLD+1] x 2 ^ 13 / RTICLK1where: RTIDWDPRLD = 0...4095" range="11:0" rwaccess="R/W"/>
	</register><register id="RTI_RTIWDSTATUS" acronym="RTI_RTIWDSTATUS" offset="152" width="32" description="Watchdog Status reflects the status of Analog and Digital Watchdog.">
		<bitfield id="RESERVED18" width="26" begin="31" end="6" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:6" rwaccess="R/W"/>
	<bitfield id="DWWD_ST" width="1" begin="5" end="5" resetval="0x0" description="DWWD ST: Windowed Watchdog Status.This bit denotes whether the time-window defined by the windowed watchdog configuration has been violated, or if a wrong key or key sequence was written to service the watchdog.User and priviledge mode [read]:0 = no time-window violation has occurred.1 = a time-window violation has occurred. The watchdog will generate either a system reset or a non-maskable interrupt to the CPU in this case.Priviledge mode [write]:0 = leaves the current value unchanged.1 = clears the bit to 0. This will also clear all other status flags in the RTIWDSTATUS register except for the AWD ST flag. Clearing of the status flags will deassert the non-maskable interrupt generated due to violation of the DWWD." range="5" rwaccess="R/W"/>
	<bitfield id="ENDTIMEVIOL" width="1" begin="4" end="4" resetval="0x0" description="END TIME VIOL: Windowed Watchdog End Time Violation Status.This bit denotes whether the end-time defined by the windowed watchdog configuration has been violated. This bit is effectively a copy of the DWD ST status flag.User and priviledge mode [read]:0 = no end-time window violation has occurred.1 = the end-time defined by the windowed watchdog configuration has been violated.Priviledge mode [write]:0 = leaves the current value unchanged.1 = clears the bit to 0." range="4" rwaccess="R/W"/>
	<bitfield id="STARTTIMEVIOL" width="1" begin="3" end="3" resetval="0x0" description="START TIME VIOL: Windowed Watchdog Start Time Violation Status. This bit denotes whether the start-time defined by the windowed watchdog configuration has been violated. This indicates that the WWD was serviced before the service window was opened.User and priviledge mode [read]:0 = no start-time window violation has occurred.1 = the start-time defined by the windowed watchdog configuration has been violated.Priviledge mode [write]:0 = leaves the current value unchanged.1 = clears the bit to 0." range="3" rwaccess="R/W"/>
	<bitfield id="KEYST" width="1" begin="2" end="2" resetval="0x0" description="KEYST: Watchdog KeyStatus.This bit denotes a reset generated by a wrong key or a wrong key-sequence written to the RTIWDKEY register.User and priviledge mode [read]:0 = no wrong key or key-sequence written1 = wrong key or key-sequence written to RTIWDKEY registerPriviledge mode [write]:0 = leaves the current value unchanged1 = clears the bit to 0" range="2" rwaccess="R/W"/>
	<bitfield id="DWDST" width="1" begin="1" end="1" resetval="0x0" description="DWDST: Digital Watchdog Status.This bit is effectively a copy of the END TIME VIOL status flag and is maintained for compatibility reasons.User and priviledge mode [read]:0 = DWD timeout period not expired1 = DWD timeout period has expiredPriviledge mode [write]:0 = leaves the current value unchanged1 = clears the bit to 0" range="1" rwaccess="R/W"/>
	<bitfield id="AWDST" width="1" begin="0" end="0" resetval="0x0" description="AWDST: Analog Watchdog Status.User and priviledge mode [read]:0 = AWD pin 0 > 1 threshold not exceeded1 = AWD pin 0 > 1 threshold exceededPriviledge mode [write]:0 = leaves the current value unchanged1 = clears the bit to 0" range="0" rwaccess="R/W"/>
	</register><register id="RTI_RTIWDKEY" acronym="RTI_RTIWDKEY" offset="156" width="32" description="Watchdog Key correct written key values discharge the external capacitor.">
		<bitfield id="RESERVED19" width="16" begin="31" end="16" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:16" rwaccess="R/W"/>
	<bitfield id="WDKEY" width="16" begin="15" end="0" resetval="0x0" description="WDKEY: Watchdog Key.User and privilege mode reads are indeterminate.Privilege mode [write]:A write of 0xE51A followed by 0xA35C in two separate write operations defines the Key Sequence and discharges the watchdog capacitor. This also causes the upper 12 bits of the DWD down counter to be reloaded with the contents of the DWD preload register and the lower 13 bits to become all 1s. Writing any other value causes a digital watchdog reset, as shown in Table 1-3.Note: Register write access time precautionThe user has to take into account that the write to the register takes 3 VCLK cycle. This needs to be considered for the AWD/DWD expiration calculation." range="15:0" rwaccess="R/W"/>
	</register><register id="RTI_RTIDWDCNTR" acronym="RTI_RTIDWDCNTR" offset="160" width="32" description="Digital Watchdog Down Counter current value of DWD down counter.">
		<bitfield id="RESERVED20" width="7" begin="31" end="25" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:25" rwaccess="R/W"/>
	<bitfield id="DWDCNTR" width="25" begin="24" end="0" resetval="0x0" description="DWDCNTR: Digital Watchdog Down Counter.The value of the DWDCNTR after a system reset is 0x002D_FFFF. When the DWD is enabled and the DWD counter starts counting down from this value with an RTICLK1 time base of 3MHz, a watchdog reset will be generated in 1 second.User and privilege mode [read]:Reads return the current counter value.Privilege mode [write]:Writes dont have an effect." range="24:0" rwaccess="R/W"/>
	</register><register id="RTI_RTIWWDRXNCTRL" acronym="RTI_RTIWWDRXNCTRL" offset="164" width="32" description="Windowed Watchdog Reaction Control configures the windowed watchdog to either generate a non-maskable interrupt to the CPU or to generate a system reset.">
		<bitfield id="RESERVED21" width="28" begin="31" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:4" rwaccess="R/W"/>
	<bitfield id="WWDRXN" width="4" begin="3" end="0" resetval="0x0" description="WWDRXN: Digital Windowed Watchdog Reaction.User and privilege mode [read], privileged mode [write]:0x5 = This is the default value. The windowed watchdog will cause a reset if the watchdog is serviced outside the time window defined by the configuration, or if the watchdog is not serviced at all.0xA = The windowed watchdog will generate a non-maskable interrupt to the CPU if the watchdog is serviced outside the time window defined by the configuration, or if the watchdog is not serviced at all.Writing any other value will cause a system reset if the watchdog is serviced outside the time window defined by the configuration, or if the watchdog is not serviced at all.Note: Configuration of DWWD ReactionThe DWWD reaction can be selected by the application even when the DWWD counter is already enabled.If a change to the WWDRXN is made before the watchdog service window is opened, then the change in the configuration takes effect immediately.If a change to the WWDRXN is made when the watchdog service window is already open, then the change in configuration takes effect only after the watchdog is serviced." range="3:0" rwaccess="R/W"/>
	</register><register id="RTI_RTIWWDSIZECTRL" acronym="RTI_RTIWWDSIZECTRL" offset="168" width="32" description="Windowed Watchdog Size Control configures the size of the window for the digital windowed watchdog.">
		<bitfield id="WWDSIZE" width="32" begin="31" end="0" resetval="0x0" description="WWDSIZE: Digital Windowed Watchdog Window Size.User and privilege mode [read], privileged mode [write]:Value written to WWDSIZE    Window Size0x00000005                                   100% [Functionality same as the time-out digital watchdog.]0x00000050                                   50%0x00000500                                   25%0x00005000                                  12.5%0x00050000                                  6.25%0x00500000                                  3.125%Any other value                          3.125%Note: Incorrect value being written to watchdog window size control registerIf an incorerct value is written to the WWDSIZE field, or if a system disturbance causes the WWDSIZE field to have a value other than 0x5, 0x50, 0x500, 0x5000, 0x50000, or 0x500000, then the window size will be configured to be 3.125%. This increases the chances of getting a reset due to the windowed watchdog, which enables the system to handle the cause for the incorrect configuration.Note: Configuration of DWWD Window SizeThe DWWD window size can be selected by the application even when the DWWD counter is already enabled.If a change to the WWDSIZE is made before the watchdog service window is opened, then the change in the configuration takes effect immediately.If a change to the WWDSIZE is made when the watchdog service window is already open, then" range="31:0" rwaccess="R/W"/>
	</register><register id="RTI_RTIINTCLRENABLE" acronym="RTI_RTIINTCLRENABLE" offset="172" width="32" description="RTI Compare Interrupt Clear Enable enable the auto clear functionality for each of the compare interrupts.">
		<bitfield id="RESERVED25" width="4" begin="31" end="28" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31:28" rwaccess="R/W"/>
	<bitfield id="INTCLRENABLE3" width="4" begin="27" end="24" resetval="0x0" description="INTCLRENABLE3.Enables the auto-clear functionality on the compare 3 interrupt.User and Privileged mode [read]:0x5 = Auto-clear for compare 3 interrupt is disabled.Any other value = Auto-clear for compare 3 interrupt is enabled.Privileged mode [write]:0x5 = Disables the auto-clear functionality on the compare 3 interrupt.Any other value = Enables the auto-clear functionality on the compare 3 interrupt." range="27:24" rwaccess="R/W"/>
