ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/RTI_RTI_52180000h.xml
	<bitfield id="RESERVED24" width="4" begin="23" end="20" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="23:20" rwaccess="R/W"/>
	<bitfield id="INTCLRENABLE2" width="4" begin="19" end="16" resetval="0x0" description="INTCLRENABLE2.Enables the auto-clear functionality on the compare 2 interrupt.User and Privileged mode [read]:0x5 = Auto-clear for compare 2 interrupt is disabled.Any other value = Auto-clear for compare 2 interrupt is enabled.Privileged mode [write]:0x5 = Disables the auto-clear functionality on the compare 2 interrupt.Any other value = Enables the auto-clear functionality on the compare 2 interrupt." range="19:16" rwaccess="R/W"/>
	<bitfield id="RESERVED23" width="4" begin="15" end="12" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="15:12" rwaccess="R/W"/>
	<bitfield id="INTCLRENABLE1" width="4" begin="11" end="8" resetval="0x0" description="INTCLRENABLE1.Enables the auto-clear functionality on the compare 1 interrupt.User and Privileged mode [read]:0x5 = Auto-clear for compare 1 interrupt is disabled.Any other value = Auto-clear for compare 1 interrupt is enabled.Privileged mode [write]:0x5 = Disables the auto-clear functionality on the compare 1 interrupt.Any other value = Enables the auto-clear functionality on the compare 1 interrupt." range="11:8" rwaccess="R/W"/>
	<bitfield id="RESERVED22" width="4" begin="7" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="7:4" rwaccess="R/W"/>
	<bitfield id="INTCLRENABLE0" width="4" begin="3" end="0" resetval="0x0" description="INTCLRENABLE0.Enables the auto-clear functionality on the compare 0 interrupt.User and Privileged mode [read]:0x5 = Auto-clear for compare 0 interrupt is disabled.Any other value = Auto-clear for compare 0 interrupt is enabled.Privileged mode [write]:0x5 = Disables the auto-clear functionality on the compare 0 interrupt.Any other value = Enables the auto-clear functionality on the compare 0 interrupt." range="3:0" rwaccess="R/W"/>
	</register><register id="RTI_RTICOMP0CLR" acronym="RTI_RTICOMP0CLR" offset="176" width="32" description="Compare 0 Clear compare value to be compared with the counter to clear the compare0 interrupt line.">
		<bitfield id="COMP0CLR" width="32" begin="31" end="0" resetval="0x0" description="COMP0CLR: Compare 0 Clear.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, the compare 0 interrupt or DMA request line is cleared.User and privilege mode [read]:current compare valuePrivilege mode [write]:update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31:0" rwaccess="R/W"/>
	</register><register id="RTI_RTICOMP1CLR" acronym="RTI_RTICOMP1CLR" offset="180" width="32" description="Compare 1 Clear compare value to be compared with the counter to clear the compare1 interrupt line.">
		<bitfield id="COMP1CLR" width="32" begin="31" end="0" resetval="0x0" description="COMP1CLR: Compare 1 Clear.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, the Compare 1 interrupt or DMA request line is cleared.User and privilege mode [read]:current compare valuePrivilege mode [write]:update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31:0" rwaccess="R/W"/>
	</register><register id="RTI_RTICOMP2CLR" acronym="RTI_RTICOMP2CLR" offset="184" width="32" description="Compare 2 Clear compare value to be compared with the counter to clear the compare2 interrupt line.">
		<bitfield id="COMP2CLR" width="32" begin="31" end="0" resetval="0x0" description="COMP2CLR: Compare 2 Clear.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, the Compare 2 interrupt or DMA request line is cleared.User and privilege mode [read]:current compare valuePrivilege mode [write]:update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31:0" rwaccess="R/W"/>
	</register><register id="RTI_RTICOMP3CLR" acronym="RTI_RTICOMP3CLR" offset="188" width="32" description="Compare 3 Clear compare value to be compared with the counter to clear the compare3 interrupt line.">
		<bitfield id="COMP3CLR" width="32" begin="31" end="0" resetval="0x0" description="COMP3CLR: Compare 3 Clear.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, the Compare 3 interrupt or DMA request line is cleared.User and privilege mode [read]:current compare valuePrivilege mode [write]:update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31:0" rwaccess="R/W"/>
	</register>
</module>